package sudoku;


public class APP{

	public static void main(String[] args) throws Exception {
		int [][] table = {
				{2,0,0,0,7,0,0,3,8},
				{0,0,0,0,0,6,0,7,0},
				{3,0,0,0,4,0,6,0,0},
				{0,0,8,0,2,0,7,0,0},
				{1,0,0,0,0,0,0,0,6},
				{0,0,7,0,3,0,4,0,0},
				{0,0,4,0,8,0,0,0,9},
				{0,6,0,4,0,0,0,0,0},
				{9,1,0,0,6,0,0,0,2}
							};
		int [][] table3 = {
				{0,0,6,8,7,1,2,0,0},
				{0,0,0,0,0,0,0,0,0},
				{5,0,1,3,0,9,7,0,8},
				{1,0,7,0,0,0,6,0,9},
				{2,0,0,0,0,0,0,0,7},
				{9,0,3,0,0,0,8,0,1},
				{3,0,5,9,0,7,4,0,2},
				{0,0,0,0,0,0,0,0,0},
				{0,0,2,4,3,5,1,0,0}
							};
		int [][] table4 = {
				{0,6,0,7,0,0,0,5,0},
				{0,0,0,0,0,6,0,0,1},
				{2,0,0,0,4,0,0,9,0},
				{0,0,4,5,0,0,0,0,0},
				{0,2,0,9,0,0,0,6,0},
				{7,0,0,2,3,0,0,0,4},
				{0,0,0,0,0,0,0,0,7},
				{8,3,0,0,0,0,0,0,0},
				{9,5,7,0,0,0,0,0,0},
							};
		Sudoku q = new Sudoku(table4);
		System.out.println(q.toString()+"\n");
		
		long start = System.nanoTime();
		Solver s = new Solver(q);
		Sudoku res = s.solve();
		long end = System.nanoTime();
		System.out.println(res.toString());
		System.out.println("Решено за "+(end-start)/1000000000.+"с");
		}
}
